Revit 2024 API
FieldValues Constructor
Overload List
Name | Description
FieldValues(FieldValues)
 Creates a copy of the given FieldValues instance.
FieldValues(IList<ValueAtPoint>)
 Creates object from an array of domain point values
FieldValues(IList<VectorAtPoint>)
 Creates object from an array of domain point vectors
FieldValues(IList<ValueAtPoint>, XYZ)
 Creates object from an array of domain point values
See Also
FieldValues Class
FieldValues Members
Autodesk.Revit.DB.Analysis Namespace